DataProcessors/МакетыШаблоновСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МакетыШаблоновСообщений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыТранспортаУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Email</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыОпределенияМоментаУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияМоментаУведомления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдновременноССобытием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеСобытия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЕдиницыИзмеренияИнтервалаУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмеренияИнтервалаУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЭтаповРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповРаботыСКандидатами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пройден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецШаблонаСообщения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяТипаПараметраВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляЭлектронныхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаSMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекстаПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРедактированияЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранслитерироватьИменаФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковатьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПоВнешнейОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормыИВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РассылкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РассылкиУведомлений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияМоментаУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияМоментаУведомления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияИнтервалаУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияИнтервалаУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкземплярТипаПредмета</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленийФиксированные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПолучательУведомлений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленийДинамические</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МакетыШаблоновСообщений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выполняет формирование шаблонов поздравлений с рассылками уведомлений
//
Процедура СформироватьРассылкиСШаблонамиПоздравлений(ПараметрыОбновления = Неопределено) Экспорт
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ДниРождения");
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		
		// Поздравление с днем рождения (письмо).
		ШаблонПоздравления = ШаблонПоздравленияСДнемРождения(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСДнемРождения(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
		// Поздравление с юбилеем.
		ШаблонПоздравления = ШаблонПоздравленияСЮбилеем(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСЮбилеем(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
		// Поздравление с юбилеем (благодарность).
		ШаблонПоздравления = ШаблонПоздравленияСЮбилеемБлагодарность(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСЮбилеемБлагодарность(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
	КонецЕсли;
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ГодовщиныРаботыВКомпании");
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		
		// Годовщины работы в компании (письмо).
		ШаблонПоздравления = ШаблонПоздравленияСГодовщинойРаботы(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСГодовщинойРаботы(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
		// Юбилеи работы в компании.
		ШаблонПоздравления = ШаблонПоздравленияСЮбилеемРаботы(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСЮбилеемРаботы(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
	КонецЕсли;
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ПервыйРабочийДень");
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		
		// Поздравление с первым рабочим днем (письмо).
		ШаблонПоздравления = ШаблонПоздравленияСПервымРабочимДнем(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСПервымРабочимДнем(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет формирование шаблона предстоящего собеседования с рассылкой уведомления
//
Процедура СформироватьРассылкуСШаблономПредстоящегоСобеседованияПисьмо(ПараметрыОбновления = Неопределено) Экспорт
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ЭтапРаботыСКандидатом");
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		
		// Приглашение на собеседование (письмо).
		ШаблонПриглашения = ШаблонПредстоящегоСобеседования(ВидУведомления);
		Если ШаблонПриглашения <> Неопределено Тогда
			СформироватьРассылкуПредстоящегоСобеседования(ВидУведомления, ШаблонПриглашения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление шаблона истичения срока анкетирования
//
Процедура ОбновитьШаблонИстеченияСрокаАнкетирования(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(НСтр("ru='Истекает срок опроса'"), Истина);
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ИстечениеСрокаАнкетирования");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление шаблона приближающегося отпуска по графику
//
Процедура ОбновитьШаблонПриближающегосяОтпуска(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(НСтр("ru = 'Уведомление о приближающемся отпуске'"), Истина);
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.ТемаПисьма = НСтр("ru='Приближается ваш отпуск'");
			ШаблонОбъект.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ПриближающийсяОтпуск");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление шаблона утвержденной заявки на отпуск
//
Процедура ОбновитьШаблонУтвержденногоОтпуска(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(НСтр("ru='Уведомление об утверждении заявки на отпуск'"), Истина);
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.ТемаПисьма = НСтр("ru='Заявление на отпуск согласовано'");
			ШаблонОбъект.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("УтвержденныйОтпуск");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление шаблона предстоящего обучения
//
Процедура ОбновитьШаблонПредстоящегоОбучения(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(НСтр("ru='Уведомление о предстоящем обучении'"), Истина);
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.ТемаПисьма = НСтр("ru='Напоминание об обучении'");
			ШаблонОбъект.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ПредстоящееОбучение");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Поздравления

Процедура СформироватьРассылкуПоздравленияСДнемРождения(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Поздравление сотрудников с днем рождения (письмо)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "Возраст";
	СтрокаОтбора.ПравоеЗначение = ВозрастЮбиляров();
	СтрокаОтбора.ВидСравнения = ВидСравнения.НеВСписке;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СписокЗначений");
	СтрокаОтбора.Представление = НСтр("ru='Возраст'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСЮбилеем(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Поздравление сотрудников с юбилеем'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "Возраст";
	СтрокаОтбора.ПравоеЗначение = ВозрастЮбиляров();
	СтрокаОтбора.ВидСравнения = ВидСравнения.ВСписке;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СписокЗначений");
	СтрокаОтбора.Представление = НСтр("ru='Возраст'");
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "ОтработаноЛет";
	СтрокаОтбора.ПравоеЗначение = 5;
	СтрокаОтбора.ВидСравнения = ВидСравнения.Меньше;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("Число");
	СтрокаОтбора.Представление = НСтр("ru='Отработано лет'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСЮбилеемБлагодарность(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Поздравление сотрудников с юбилеем (благодарность)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "Возраст";
	СтрокаОтбора.ПравоеЗначение = ВозрастЮбиляров();
	СтрокаОтбора.ВидСравнения = ВидСравнения.ВСписке;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СписокЗначений");
	СтрокаОтбора.Представление = НСтр("ru='Возраст'");
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "ОтработаноЛет";
	СтрокаОтбора.ПравоеЗначение = 5;
	СтрокаОтбора.ВидСравнения = ВидСравнения.БольшеИлиРавно;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("Число");
	СтрокаОтбора.Представление = НСтр("ru='Отработано лет'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСГодовщинойРаботы(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Годовщины работы в компании (письмо)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "ОтработаноЛет";
	СтрокаОтбора.ПравоеЗначение = 1;
	СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("Число");
	СтрокаОтбора.Представление = НСтр("ru='Отработано лет'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСЮбилеемРаботы(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Юбилеи работы в компании'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "ОтработаноЛет";
	СтрокаОтбора.ПравоеЗначение = ЮбилейныеСрокиРаботыВКомпании();
	СтрокаОтбора.ВидСравнения = ВидСравнения.ВСписке;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СписокЗначений");
	СтрокаОтбора.Представление = НСтр("ru='Отработано лет'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСПервымРабочимДнем(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Первый рабочий день (письмо)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Функция ШаблонПоздравленияСДнемРождения(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Поздравление с днем рождения (письмо)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С днем рождения!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ДеньРождения");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСЮбилеем(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Поздравление с юбилеем'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С юбилеем!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("Юбилей");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСЮбилеемБлагодарность(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Поздравление с юбилеем (благодарность)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'Благодарность в день юбилея!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ЮбилейБлагодарность");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСГодовщинойРаботы(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Годовщины работы в компании (письмо)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С годовщиной!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ГодовщинаРаботыВКомпании");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСЮбилеемРаботы(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Юбилеи работы в компании'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С юбилеем работы в компании!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ЮбилейРаботыВКомпании");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСПервымРабочимДнем(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Первый рабочий день (письмо)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С первым рабочим днем!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ПервыйРабочийДень");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ВозрастЮбиляров()
	
	ВозрастЮбиляров = Новый СписокЗначений;
	ВозрастЮбиляров.Добавить(45);
	ВозрастЮбиляров.Добавить(50);
	ВозрастЮбиляров.Добавить(55);
	ВозрастЮбиляров.Добавить(60);
	ВозрастЮбиляров.Добавить(65);
	ВозрастЮбиляров.Добавить(70);
	ВозрастЮбиляров.Добавить(75);
	
	Возврат ВозрастЮбиляров;
	
КонецФункции

Функция ЮбилейныеСрокиРаботыВКомпании()
	
	ЮбилейныеСроки = Новый СписокЗначений;
	ЮбилейныеСроки.Добавить(5);
	ЮбилейныеСроки.Добавить(10);
	ЮбилейныеСроки.Добавить(15);
	ЮбилейныеСроки.Добавить(20);
	ЮбилейныеСроки.Добавить(25);
	ЮбилейныеСроки.Добавить(30);
	ЮбилейныеСроки.Добавить(35);
	ЮбилейныеСроки.Добавить(40);
	ЮбилейныеСроки.Добавить(45);
	ЮбилейныеСроки.Добавить(50);
	ЮбилейныеСроки.Добавить(55);
	ЮбилейныеСроки.Добавить(60);
	
	Возврат ЮбилейныеСроки;
	
КонецФункции

#КонецОбласти

Процедура СформироватьРассылкуПредстоящегоСобеседования(ВидУведомления, ШаблонПриглашения)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Уведомление о предстоящем собеседовании (письмо)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ДоСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ИнтервалУведомления = 3;
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПриглашения;
	
	ЭтапСобеседование = Справочники.ЭтапыРаботыСКандидатами.НайтиПоНаименованию("Собеседование");
	Если ЗначениеЗаполнено(ЭтапСобеседование) Тогда
		НастройкиОтборов = НастройкиОтборовРассылки();
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЭтапРаботы";
		СтрокаОтбора.ПравоеЗначение = ЭтапСобеседование;
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.Использование = Истина;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами");
		СтрокаОтбора.Представление = НСтр("ru='Этап работы'");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "СостояниеЭтапа";
		СтрокаОтбора.ПравоеЗначение = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован;
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.Использование = Истина;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами");
		СтрокаОтбора.Представление = НСтр("ru='Состояние этапа'");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЦелеваяПозиция";
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание");
		СтрокаОтбора.Представление = НСтр("ru='Целевая позиция'");
		СтрокаОтбора.ПравоеЗначение 	= СтрокаОтбора.ОписаниеТипов.ПривестиЗначение();
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЦелевоеПодразделение";
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
		СтрокаОтбора.Представление = НСтр("ru='Целевое подразделение'");
		СтрокаОтбора.ПравоеЗначение 	= СтрокаОтбора.ОписаниеТипов.ПривестиЗначение();
		
		РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Функция ШаблонПредстоящегоСобеседования(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Уведомление о предстоящем собеседовании (письмо)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'Напоминание о собеседовании'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ПредстоящееСобеседование");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ТекстШаблонаИзМакета(ИмяМакета)
	
	Макет = Обработки.МакетыШаблоновСообщений.ПолучитьМакет(ИмяМакета);
	Возврат Макет.ПолучитьТекст();
	
КонецФункции

Функция НастройкиОтборовРассылки()
	
	НастройкиОтборов = Новый ТаблицаЗначений;
	НастройкиОтборов.Колонки.Добавить("ЛевоеЗначение");
	НастройкиОтборов.Колонки.Добавить("ВидСравнения");
	НастройкиОтборов.Колонки.Добавить("ПравоеЗначение");
	НастройкиОтборов.Колонки.Добавить("Использование");
	НастройкиОтборов.Колонки.Добавить("ОписаниеТипов");
	НастройкиОтборов.Колонки.Добавить("Представление");
	
	Возврат НастройкиОтборов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
